УТ_для_edt.ДоставкаДеловыеЛинии/src/InformationRegisters/ДЛ_ЛогЗапросов/ДЛ_ЛогЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДЛ_ЛогЗапросов</name>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Получено</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НазваниеМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.ДоставкаДеловыеЛинии/src/CommonForms/ДЛ_Настройки/Module.bsl
&НаКлиенте
Процедура ПараметрыПодключенияДанныеКлючПриложенияИнфоОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДЛ_ДеловыеЛинииКлиент.ОткрытьСтраницуВБраузере(АдресРазделаСайтаРегистрацияПриложения());
	
КонецПроцедуры 

&НаКлиенте
Функция АдресРазделаСайтаРегистрацияПриложения()
	
	Возврат "https://dev.dellin.ru/registration/";
	
КонецФункции  

&НаКлиенте
Функция АдресРазделаСайтаРегистрацияВЛичномКабинете()
	
	Возврат "https://www.dellin.ru";
	
КонецФункции

&НаКлиенте
Процедура днАвторизацияНажатие(Элемент)

	
	СтандартнаяОбработка = Ложь;
	ДЛ_ДеловыеЛинииКлиент.ОткрытьСтраницуВБраузере(АдресРазделаСайтаРегистрацияВЛичномКабинете());

КонецПроцедуры

&НаКлиенте
Процедура ДЛ_СерверПриИзменении(Элемент)
	
	АдресСервера = СокрЛП(НаборКонстант.ДЛ_Сервер);	
	АдресСервера = СтрЗаменить(АдресСервера, "https://", ""); 
	АдресСервера = СтрЗаменить(АдресСервера, "http://", "");
	НаборКонстант.ДЛ_Сервер = ?(Прав(АдресСервера, 1) = "/", Лев(АдресСервера, СтрДлина(АдресСервера) - 1), АдресСервера); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеНовойВерсии(Команда) 
	
	ДЛ_ДеловыеЛинииКлиент.ПроверитьНаличиеНовойВерсии(ЭтаФорма, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(НаборКонстант.ДЛ_Сервер) Тогда
		
		НаборКонстант.ДЛ_Сервер = "api.dellin.ru";	
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(НаборКонстант.ДЛ_МинимальнаяДлина) Тогда
		
		НаборКонстант.ДЛ_МинимальнаяДлина = 0.1;	
		
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(НаборКонстант.ДЛ_МинимальнаяШирина) Тогда
		
		НаборКонстант.ДЛ_МинимальнаяШирина = 0.1;	
		
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(НаборКонстант.ДЛ_МинимальнаяВысота) Тогда
		
		НаборКонстант.ДЛ_МинимальнаяВысота = 0.1;	
		
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(НаборКонстант.ДЛ_МинимальныйОбъем) Тогда
		
		НаборКонстант.ДЛ_МинимальныйОбъем = 0.01;	
		
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(НаборКонстант.ДЛ_МинимальныйВес) Тогда
		
		НаборКонстант.ДЛ_МинимальныйВес = 1;	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДШВ_ПриИзменении(Элемент)
	
	НаборКонстант.ДЛ_МинимальныйОбъем = Макс(0.01, НаборКонстант.ДЛ_МинимальнаяДлина * НаборКонстант.ДЛ_МинимальнаяШирина * НаборКонстант.ДЛ_МинимальнаяВысота);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Если ПроверитьПодключениеНаСервере() Тогда
		
		ПоказатьПредупреждение(, "Подключение успешно установлено");
		
	Иначе 
		
		ПоказатьПредупреждение(, "Ошибка подключения. Подробности в регистре логов.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПодключениеНаСервере() 	
	
	СтруктураПараметров = Новый Структура;			              
	СтруктураПараметров.Вставить("appKey", НаборКонстант.ДЛ_appkey);
	СтруктураПараметров.Вставить("login", НаборКонстант.ДЛ_Логин);
	СтруктураПараметров.Вставить("password", НаборКонстант.ДЛ_Пароль);		
	 
	СериализованныеПараметры = ДЛ_ДеловыеЛинии.СериализоватьСтруктуруПараметров(СтруктураПараметров); 	
	
	Соединение = Новый HTTPСоединение(НаборКонстант.ДЛ_Сервер,,,, 
		ДЛ_ДеловыеЛинии.НовыйИнтернетПрокси(НаборКонстант.ДЛ_ПроксиСервер), 
		?(НаборКонстант.ДЛ_Таймаут = 0, 45, НаборКонстант.ДЛ_Таймаут), 
		Новый ЗащищенноеСоединениеOpenSSL());
		
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json; charset=utf-8");	
	
	АдресМетода = ДЛ_ДеловыеЛинии.АдресМетода("Авторизация"); 
	
	Запрос = Новый HTTPЗапрос(АдресМетода, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СериализованныеПараметры, "UTF-8"); 
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
	
	Попытка
	
		Ответ  = Соединение.ОтправитьДляОбработки(Запрос);  
		Получено = Ответ.ПолучитьТелоКакСтроку();
		
	Исключение
		
		Ответ = Новый Структура("КодСостояния", 0);
		Получено = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;	
	
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Результат = (Ответ.КодСостояния = 200);
	
	Если Не Результат Тогда
		
		ЛогЗапросов = РегистрыСведений.ДЛ_ЛогЗапросов.СоздатьМенеджерЗаписи();
		ЛогЗапросов.Метод = АдресМетода;
		ЛогЗапросов.Дата = ТекущаяДатаСеанса();
		ЛогЗапросов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		ЛогЗапросов.Отправлено = СериализованныеПараметры;
		ЛогЗапросов.Получено = Получено;
		ЛогЗапросов.ВремяВыполнения = ВремяОкончания - ВремяНачала; 
		ЛогЗапросов.НазваниеМетода = "Проверка подключения";
		ЛогЗапросов.Записать(Истина);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
